[
  {
    "title": "COMMUNIFY",
    "image": "./assets/pics/communify.PNG",
    "description": "Communify was a final project in the UofA 24 week Coding Bootcamp that utilised the MERN full stack web development framework.  MongoDB, Express, React and Node were the foundation on which the application was built.  React-Materialize was used as the styling framework along with standard Materialize CSS.  The aims to create a platform where users create tasks that other users can complete in a volunteering type environment.  The app allows users to create and update their profiles and start earning status points that are used to level up the user.  The objective is to make it fun and allow volunteers to track their progress",
    "repo": "https://github.com/EMoschos/communify",
    "deployed": "https://communify-2020.herokuapp.com/"
  },
  {
    "title": "SCHOOLGLE",
    "image": "./assets/pics/schoolgle.PNG",
    "description": "SCHOOLGLE was created to help parents best decide where to send their children to school through an easy-to-use interface backed by data that matters. All the data has been provided by the Australian Education Department so parents are able to make the best-informed decision possible about their children's education. The App was created using Full-stack web development tools such as Node.js, MySQL, Express.js, Sequelize, Passport.js, bCrypt.js, Handlebars.js with integration of Google Maps API, Materialize CSS and Print.js",
    "repo": "https://github.com/Andrew836-dev/project2",
    "deployed": "https://schoolgle.herokuapp.com/"
  },
  {
    "title": "My-Employee",
    "image": "./assets/pics/My-Employee.PNG",
    "description": "View employee directory and access their information with ability to sort and search.  This app was created to showcase the use of React.js and the ability to store state, sort and filter",
    "repo": "https://github.com/EMoschos/my-employee",
    "deployed": "https://emoschos.github.io/my-employee/"
  },
  {
    "title": "Budgetify",
    "image": "./assets/pics/budgetifydownload.png",
    "description": "Budgetify is a Progressive Web App (PWA) that allows you to keep track of your incoming and outgoing funds. Budgetify was created with the user in mind so that it is fully functional with 'NO' internet connection (Offline).  The PWA technology also allows the app to be downloaded 'Like' a native app to your phone or laptop.  NOTE: This is a test app and will contain test data",
    "repo": "https://github.com/EMoschos/budgetify",
    "deployed": "https://budgetify-offline.herokuapp.com/"
  },
  {
    "title": "Mongo-Fitt",
    "image": "./assets/pics/Mongo-Fitt.PNG",
    "description": "Mongo-Fitt is a workout tracker that allows the user to create workouts and add multiple exercises. There are two types of exercises to choose 'Resistance' and 'Cardio' these come with pre-select fields that the user enters data. The app was created using MongoDB Atlas, Heroku and Mongoose along side Node.js. A MVC structure was implemented to achieve the final result",
    "repo": "https://github.com/EMoschos/mongo-workout",
    "deployed": "https://mongo-fitt.herokuapp.com/"
  },
  {
    "title": "HandleBurger-Express",
    "image": "./assets/pics/BurgerApp.PNG",
    "description": "The HandleBurger-Express App is a fun easy to use application that utilizes fullstack web development. The app was intended to showcase the use of mySQL, Express.js, HandleBars, Node.js and is deployed on the Heroku platform with JawsDB add-on.",
    "repo": "https://github.com/EMoschos/burger-express",
    "deployed": "https://young-mountain-78701.herokuapp.com/"
  },
  {
    "title": "Doggo App",
    "image": "./assets/pics/DoggoApp.PNG",
    "description": "The Doggo app is designed to help the user find information on dog breeds they are interested in. They can enter part of the name of a breed, and the search will return the five closest matches. The user can then click on the breed they would like to learn more about.  The page will then display a photo of the breed, along with key information: breed group, typical height & weight, life span & temperament. It will also include a Wikipedia description down the bottom. This App was a collaboration project!",
    "repo": "https://github.com/gussell87/doggo",
    "deployed": "https://gussell87.github.io/Doggo/"
  },
  {
    "title": "How's the Weather App",
    "image": "./assets/pics/WeatherApp.PNG",
    "description": "The Hows the weather app was built to show current day weather and a 5 day forecast for any location in the world!!!",
    "repo": "https://github.com/EMoschos/hows-the-weather",
    "deployed": "https://emoschos.github.io/hows-the-weather/"
  },
  {
    "title": "Work Day Planner App",
    "image": "./assets/pics/PlannerApp.png",
    "description": "Daily planner from 9am to 5pm with displayed date and time with highlighted parts of the day to keep you on track!",
    "repo": "https://github.com/EMoschos/plan-my-time-away/",
    "deployed": "https://emoschos.github.io/plan-my-time-away/"
  },
  {
    "title": "Quiz Wizz App",
    "image": "./assets/pics/QuizApp.PNG",
    "description": "A timed quiz about JavaScript General Knowledge that allows you to save your best scores so you can work hard on your PB's!",
    "repo": "https://github.com/EMoschos/Code-Quiz-Wizz",
    "deployed": "https://emoschos.github.io/Code-Quiz-Wizz/"
  }
]